此书基于redis版本2.6.9

redis是remote dictionary server (远程字典服务器)的缩写，它以字典结构存储数据，并允许其他应用通过tcp协议读写字典中的内容。同大多数脚本语言中的字典样，redis 
字典中的键值除了可以是字符串，还可以是其他数据类型。redis支持的键值数据类型如下:
    ●字符串类型
    ●散列类型
    ●列表类型
    ●集合类型
    ●有序集合类型
    
redis数据库中的所有数据都存储在内存中。由于内存的读写速度远快于硬盘，因此redis在性能上对比其他基于硬盘存储的数据库有非常明显的优势，在一台普通的笔记本电
脑上，redis可以在一秒内读写超过十万个键值。

redis 约定次版本号(即第一个小数点后的数字)为偶数的版本是稳定版(如2.4版、2.6版)，奇数版本是非稳定版(如2.5 版、2.7 版),推荐使用稳定版本进行开发和在生产环境使用。

redis可执行文件说明:
    文件名             说明
   redis-server     redis服务器
   redis-cli        redis命令行客户端
   redis-benchmark  redis 性能测试工具
   redis-check-aof  aof文件修复工具
   redis-check-dump rdb文件检查工具

启动redis有直接启动和通过初始化脚本启动两种方式，分别适用于开发环境和生产环境。
    1.直接启动
      直接运行redis-server即可启动redis,十分简单:
      redis服务器默认会使用6379端口，通过--port参数可以自定义端口号:
      $>redis-server --port 6380
      6379是手机键盘上merz对应的数字，merz是一名意大利歌女的名字。
    2.通过初始化脚本启动redis
      在linux系统中可以通过初始化脚本启动redis,使得redis能随系统自动运行，在生产环境中推荐使用此方法运行redis;

停止redis:
    考虑到redis有可能正在将内存中的数据同步到硬盘中，强行终止redis进程可能会导致数据丢失。正确停止redis的方式应该是向redis发送shutdown命令，方
法为:$> redis-cli shutdown
    当redis收到shutdown命令后，会先断开所有客户端连接，然后根据配置执行持久化，最后完成退出。
    redis可以妥善处理sigterm信号，所以使用“kill redis进程的pid”也可以正常结束redis,效果与发送shutdown命令样。

发送命令:
    1.是将命令作为redis-cli的参数执行，比如redis-cli shutdown,redis-cli执行时会自动按照默认配置(服务器地址为127.0.0.1, 端口号为6379)连接redis,
    通过-h和-p参数可以自定义地址和端口号: $>redis-cli -h 127.0.0.1 -p 6379
    redis提供了ping命令来测试客户端与redis的连接是否正常，如果连接正常会收到回复pong。如:
    $>redis-cli ping
      pong
    2.是不附带参数运行redis-cli, 这样会进入交互模式，可以自由输入命令， 例如:$ redis-cli

命令返回值:
    在大多数情况下，执行一条命令后我们往往会关心命令的返回值，命令的返回值有5种类型，对于每种类型redis-cli的展现结果都不同，下面分别说明。
    1.状态回复
      状态回复(status reply)是最简单的种回复，比如向redis发送set命令设置某个键的值时，redis会回复状态ok表示设置成功。另外之前演示的对ping命令的回复pong
也是状态回复。状态回复直接显示状态信息，例如:
      redis> ping 
      pong
    2.错误回复
      当出现命令不存在或命令格式有错误等情况时redis会返回错误回复(error reply)。错误回复以(error)开头，并在后面跟上错误信息。如执行一个不存在的命令:
      redis> errorcommend
      (error) err unknown command 'errorcommend'
    3.整数回复
      redis虽然没有整数类型，但是却提供了一些用于整数操作的命令,如递增键值的incr命令会以整数形式返回递增后的键值。除此之外，一些其他命令也会返回整数，如可以获
取当前数据库中键的数量的dbsize命令等。整数回复(integer reply) 以(integer)开头，并在后面跟上整数数据:
      redis> incr foo
      (integer) 1
    4.字符串回复
      字符串回复(bulk reply)是最常见的种回复类型，当请求一个字符串类型键的键值或一个其他类型键中的某个元素时就会得到一个字符串回复。字符串回复以双引号包裹:
        redis> get foo
        "1”
      特殊情况是当请求的键值不存在时会得到一个空结果，显示为(nil)。如:
        redis> get noexists
        (ni1) 
    5.多行字符串回复
      多行字符串回复(multi-bulk reply) 同样很常见，如当请求个 非字符串类型键的元素列表时就会收到多行字符串回复。多行字符串回复中的每行字符串都以个序号开头，
      如:
        redis> keys *
        1)"bar"
        2) "foo"
        
在redis运行时通过config set命令在不重新启动redis的情况下动态修改部分redis配置。就像这样:
    redis> config set loglovel warning
    ok
同样在运行的时候也可以使用config get命令获得redis当前的配置情况，
例如:
    redis> config get 1oglavel
    11 "loglevel"
    2) "warning"
    
redis是一个字典结构的存储服务器，redis实例提供了多个用来存储数据的字典，客户端可以指定将数据存储在哪个字典中。这与我们熟知的在一个
关系数据库实例中可以创建多个数据库类似，所以可以将其中的每个字典都理解成个独立的数据库。
    每个数据库对外都是以一个从0开始的递增数字命名，redis默认支持16个数据库，可以通过配置参数databases来修改这一数字。客户端与redis建立连接后会
自动选择0号数据库，不过可以随时使用select命令更换数据库，如要选择1号数据库:
    redis> select 1
    ok
    redis[1]> get foo
    (ni1)
    redis不支持自定义数据库的名字，每个数据库都以编号命名，开发者必须自己记录哪些数据库存储了哪些数据。另外redis也不支持为每个数据库设置不同的访问密码，
所以一个客户端要么可以访问全部数据库，要么连一个数据库也没有权限访问。最重要的一点是多个数据库之间并不是完全隔离的，比如flushall命令可以清空一个redis实
例中所有数据库中的数据。

redis非常轻量级，一个空redis实例占用的内存只有1mb左右，所以不用担心多个redis实例会额外占用很多内存。

keys命令需要遍历redis中的所有键，当键的数量较多时会影响性能，不建议在生产环境中使用。

redis不区分命令大小写。

命令:
    type key: 用来获得键值的数据类型，返回值可能是string (字符串类型)、hash(散列类型)、list (列表类型)、set (集合类型)、zset (有序集合类型)。
    append key value : 向尾部追加值;
    strlen key : 获取字符串长度;

redis 提供了4个命令可以直接对二进制位进行操作:
        getbit key offset
        setbit key offset value
        bitcount key [start][end]
        bitop operation destkey key [key j


字符串类型是redis中最基本的数据类型，它能存储任何形式的字符串，包括二进制数据。你可以用其存储用户的邮箱、json化的对象甚至是-张图片。-个字符串类型键
允许存储的数据的最大容量是512mb。
字符串类型是其他4种数据类型的基础，其他数据类型和字符串类型的差别从某种角度来说只是组织字符串的形式不同。例如，列表类型是以列表的形式组织字符串，而
集合类型是以集合的形式组织字符串。

redis命令都是原子操作;

redis对于键的命名并没有强制的要求，但比较好的实践是用“对象类型:对象id:对象属性”来命名一个键，如使用键user:1:friends。对于多个单词则推荐使用“.” 分隔;

redis中每个键都属于一一个明确的数据类型，如通过hset命令建立的键是散列类型，通过set命令建立的键是字符串类型等。使用一种数据类型的命令操作另一
种数据类型的键会提示错误: "err operation against a key holding the wrong kind of value"

当字段不存在时赋值: hsetnx key field value ,不存在则赋值,否则hsetnx命令将不执行任何操作。

列表类型(list)可以存储一个有序的字符串列表，常用的操作是向列表两端添加元素，或者获得列表的某一个片段。
列表类型内部是使用双向链表( double linked list)实现的，所以向列表两端添加元素的时间复杂度为0(1),获取越接近两端的元素速度就越快。这意味着即使是一个有几千万
个元素的列表，获取头部或尾部的10条记录也是极快的(和从只有20个元素的列表中获取头部或尾部的10条记录的速度是样的)。
与散列类型键最多能容纳的字段数量相同，-个列表类型键最多能容纳23^2-1个元素。

集合间运算:
    sdiff key [key ...]
    sinter key [key ...]
    sunion key ikey ...]

进行集合运算并将结果存储:
    sdiffstore destination key [key ...]
    sinterstore destination key [key ...]
    sunionstore destination key [key ...]
    sdiffstore命令和sdiff命令功能样，唯一的区别就是前者不会直接返回运算
    结果，而是将结果存储在destination键中。

随机获得集合中的元素:
    srandmember key [count]
    srandmember命令用来随机从集合中获取多个元素，还可以传递count参数来一次随机获得多个元素，根据count的正负不同，具体表现
也不同。
    (1)当count为正数时，srandmember会随机从集合里获得count个不重复的元素。如果count的值大于集合中的元素个数，则srandmember会返回集合中的全部元素。
    (2)当count为负数时，srandmember会随机从集合里获得|count|个的元素,这些元素有可能相同。

有序集合类型(sorted set) 的特点从它的名字中就可以猜到，它集合类型(set)的区别就是“有序”二字。在集合类型的基础上有序集合类型为集合中的每个元素都关联了一个分数，
这使得我们不仅可以完成插入、删除和判断元素是否存在等集合类型支持的操作，还能够获得分数最高(或最低)的前N个元素、获得指定分数范围内的元素等与分数有关的操作。虽然集
合中每个元素都是不同的，但是它们的分数却可以相同。有序集合类型在某些方面和列表类型有些相似。
    (1)二者都是有序的。
    (2)二者都可以获得某一范围的元素。
    但是二者有着很大的区别，这使得它们的应用场景也是不同的。
    (1)列表类型是通过链表实现的，获取靠近两端的数据速度极快，而当元素增多后，
    访问中间数据的速度会较慢，所以它更加适合实现如“新鲜事”或“日志”这样很少访
    问中间元素的应用。
    (2)有序集合类型是使用散列表和跳跃表(Skip list)实现的，所以即使读取位于中间
    部分的数据速度也很快(时间复杂度是O(log(N))。
    (3)列表中不能简单地调整某个元素的位置，但是有序集合可以(通过更改这个
    元素的分数)。
    (4)有序集合要比列表类型更耗费内存。
    有序集合类型算得上是Redis的5种数据类型中最高级的类型了，在学习时可以与列
    表类型和集合类型对照理解。
